InformationRegisters/ФизическиеЛицаКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ФизическиеЛицаКандидатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛичныеДанныеКандидата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФизическиеЛицаКандидатов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ФизическоеЛицо)
	|	И ЗначениеРазрешено(ЛичныеДанныеКандидата)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает связь кандидата с физическим лицом.
// 
// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
Процедура УстановитьСвязьКандидатаСФизическимЛицом(ЛичныеДанныеКандидата, ФизическоеЛицо) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЛичныеДанныеКандидата.Установить(ЛичныеДанныеКандидата);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ЛичныеДанныеКандидата = ЛичныеДанныеКандидата;
	НоваяЗапись.ФизическоеЛицо = ФизическоеЛицо;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Удаляет связь кандидата с физическим лицом.
// 
// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
Процедура УдалитьСвязьКандидатаСФизическимЛицом(ЛичныеДанныеКандидата) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЛичныеДанныеКандидата.Установить(ЛичныеДанныеКандидата);
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Удаляет связь физического лица с кандидатом.
// 
// Параметры:
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
Процедура УдалитьСвязьФизическогоЛицаСКандидатом(ФизическоеЛицо) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ФизическиеЛицаКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата
		|ИЗ
		|	РегистрСведений.ФизическиеЛицаКандидатов КАК ФизическиеЛицаКандидатов
		|ГДЕ
		|	ФизическиеЛицаКандидатов.ФизическоеЛицо = &ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЛичныеДанныеКандидата = ВыборкаДетальныеЗаписи.ЛичныеДанныеКандидата; // СправочникСсылка.ЛичныеДанныеКандидатов
		УдалитьСвязьКандидатаСФизическимЛицом(ЛичныеДанныеКандидата);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  НаборЗаписей - РегистрСведенийНаборЗаписей.ФизическиеЛицаКандидатов
Процедура ДобавитьСубъектыДляРасчетаСроковХранения(НаборЗаписей) Экспорт
	
	Субъекты = Новый Массив; // Массив из ОпределяемыйТип.СубъектПерсональныхДанных
	
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
		Субъекты.Добавить(ЗаписьНабора.ЛичныеДанныеКандидата);
		Субъекты.Добавить(ЗаписьНабора.ФизическоеЛицо);
	КонецЦикла;
	
	Если НаборЗаписей.ДополнительныеСвойства.Свойство("ПрежнийНабор") Тогда
		Для Каждого СтрокаТаблицы Из НаборЗаписей.ДополнительныеСвойства.ПрежнийНабор Цикл
			Субъекты.Добавить(СтрокаТаблицы.ЛичныеДанныеКандидата);
			Субъекты.Добавить(СтрокаТаблицы.ФизическоеЛицо);
		КонецЦикла;
	КонецЕсли;
	
	Субъекты = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Субъекты);
	
	ЗащитаПерсональныхДанных.ДобавитьСубъектыДляРасчетаСроковХранения(Субъекты, ТекущаяДатаСеанса());
	
КонецПроцедуры

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ФизическоеЛицо", "ПодборПерсонала");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
